---
kind: type
id: T:Autodesk.Revit.DB.Events.FileExportedEventArgs
source: html/8f668506-1f9b-0282-f6df-66428891ad3b.htm
---
# Autodesk.Revit.DB.Events.FileExportedEventArgs

The event arguments used by the FileExported event.

## Syntax (C#)
```csharp
public class FileExportedEventArgs : RevitAPIPostDocEventArgs
```